//3.2
#include <stdio.h>
#include <math.h>
int main() 
{
    int a,i,j,k;
    do{
        
        scanf("%d", &a);
        a=abs (a);
        if (!(a>99 && a <1000)){
            printf("error");
        }
    }while (a>99 && a <1000);
            
     //取出个位、十位、百位
     //因为a是整数，int型的取整方式是向下取整，不用考虑四舍五入，比如 1234/1000=1，1234/100=12，1234/10=123，1234/1=1234
    //                                       计算过程
    //a=123          
     i=a/100;           //                   i=123/100=1
     j=(a-i*100)/10;    //                   123-1*100=23        23/10=2
     k=a-i*100-j*10;    //                   123-1*100-2*10=3   
    //输出
    printf("%d%d%d\n",k,j,i);//把变量位置反着放也可以正常输出
    printf("%d",k*100+j*10+i);//也可以用这种方式输出
    return 0;
}
